#Область ПрограммныйИнтерфейс

// ВКМ_ТелеграммУведомление отправляет сообщения в телеграмм группу
//
Процедура ВКМ_ТелеграммУведомление()Экспорт
	//Сделал по шаблону, как описано в задании не получается. Не пойму как сделать строу JSON и как она 
	//должна выглядеть, а так все работает.
	ЗащищенноеСоединение = Новый ЗащищенноеСоединениеOpenSSL();
	TokenTelegramm = Константы.ВКМ_ТокенУправленияТГБотом.Получить();
	IDUser = Константы.ВКМ_ИндефикаторГруппыДляОповещения.Получить(); 
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_УведомленияТелеграммБоту.Ссылка,
		|	ВКМ_УведомленияТелеграммБоту.ТекстСообщения
		|ИЗ
		|	Справочник.ВКМ_УведомленияТелеграммБоту КАК ВКМ_УведомленияТелеграммБоту";
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		Ресурс = "bot" + TokenTelegramm + "/sendMessage?chat_id=" + СтрЗаменить(Формат(IDUser, "ЧДЦ=; ЧС=; ЧРГ=."),
			".", "") + "&text= " + Выборка.ТекстСообщения;
		Соединение = Новый HTTPСоединение("api.telegram.org", 443, , , , , ЗащищенноеСоединение);
		Запрос = Новый HTTPЗапрос(Ресурс);
		//Не знаю какой нужен метод
		Ответ = Соединение.Получить(Запрос);
		Если Ответ.КодСостояния = 200 Тогда
			ДокОбъект = Выборка.Ссылка.ПолучитьОбъект();
			ДокОбъект.Удалить();
		Иначе
			ИнформацияОбОшибке = ИнформацияОбОшибке();

			ЗаписьЖурналаРегистрации("HTTPСервисы.Ошибка", УровеньЖурналаРегистрации.Ошибка, , ,
				ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке));
			ОбщегоНазначения.СообщитьПользователю(ИнформацияОбОшибке);
		КонецЕсли;

	КонецЦикла;

КонецПроцедуры

#КонецОбласти
