#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаПроведения(Отказ,Режим)
	
	Движения.ВКМ_ЗадолжностиКлиента.Записывать = Истина;
	Движения.ВКМ_ВыполненныеСотрудникомРаботы.Записывать = Истина;
	
	Выборка = ЗапросДокумента();
	
	//График работы с 9:00 до 17:00
	Если ВремяНачалаРабот > ВремяОкончанияРабот Тогда
		СообщениеТекст = ("Начало работ не может быть больше чем окончание работ");
		ОбщегоНазначения.СообщитьПользователю(СообщениеТекст);
		Отказ = Истина;
	Иначе
		ОтработаноЧасов = РассчетОтработанныхЧасов(ВремяНачалаРабот, ВремяОкончанияРабот);
	КонецЕсли;
	
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскаяПлата;
	
	Пока Выборка.Следующий() Цикл
		Если Выборка.ДоговорВидДоговора = ВидДоговора И Выборка.Дата >= Выборка.ДоговорВКМ_ПериодДействияДоговораНачало
			И Выборка.Дата <= Выборка.ДоговорВКМ_ПериодДействияДоговораКонец Тогда
			
			// регистр ВКМ_ЗадолжностиКлиента
			Движение = Движения.ВКМ_ЗадолжностиКлиента.Добавить();
			Движение.Период = Выборка.Дата;
			Движение.Клиент = Выборка.Клиент;
			Движение.Договор = Выборка.Договор;
			Движение.КоличествоЧасов = ОтработаноЧасов;
			СуммаКОплате = ОтработаноЧасов * Выборка.СтоимостьЧасаРаботы;
			Движение.СуммаКОплате = СуммаКОплате;
			
			// Регистр Выполненные сотрудником работы
			Движение = Движения.ВКМ_ВыполненныеСотрудникомРаботы.Добавить();
			Движение.Период = Выборка.Дата;
			Движение.Сотрудник = Выборка.Специалист;
			Движение.СтоимостьЧасаРаботы = Выборка.СтоимостьЧасаРаботы;
			Движение.ЧасовКОплате = ОтработаноЧасов;
			Если Выборка.ПроцентОтРабот = "Не указан" Тогда
				Отказ = Истина;
				ТекстСообщения = "Не указан процент от работ";
				ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
			Иначе
				Движение.СуммаКОплате = ОтработаноЧасов * Выборка.СтоимостьЧасаРаботы
				* Выборка.ПроцентОтРабот / 100;
			КонецЕсли;
			
		Иначе
			СообщениеТекст = ("Вид договора не АбоненскаяПлата или период договора истек");
			ОбщегоНазначения.СообщитьПользователю(СообщениеТекст);
		КонецЕсли;
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	Выборка = ЗапросДокумента();
	Если Выборка.Следующий() Тогда
		ДатаДокумента = Выборка.Дата;

		Если ДатаДокумента <> Дата Тогда
			ТекстСообщения = ("Дата изменена");
			СозданиеУведомленияТелеграммБоту(ТекстСообщения);
		КонецЕсли;

		Если Специалист <> Выборка.Специалист Тогда
			ТекстСообщения = ("Специалист был изменен");
			СозданиеУведомленияТелеграммБоту(ТекстСообщения);
		КонецЕсли;

	КонецЕсли;

	Если ЭтоНовый() Тогда
		ТекстСообщения = ("Создание нового документа");
		СозданиеУведомленияТелеграммБоту(ТекстСообщения);
	КонецЕсли;


КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ЗапросДокумента()Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВидДоговора КАК ДоговорВидДоговора,
		|	ВКМ_ОбслуживаниеКлиента.Ссылка КАК Ссылка,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияДоговораНачало КАК ДоговорВКМ_ПериодДействияДоговораНачало,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_ПериодДействияДоговораКонец КАК ДоговорВКМ_ПериодДействияДоговораКонец,
		|	ВКМ_ОбслуживаниеКлиента.Дата КАК Дата,
		|	ВКМ_ОбслуживаниеКлиента.Клиент КАК Клиент,
		|	ВКМ_ОбслуживаниеКлиента.Договор КАК Договор,
		|	ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот КАК ВремяНачалаРабот,
		|	ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот КАК ВремяОкончанияРабот,
		|	ВКМ_ОбслуживаниеКлиента.Договор.ВКМ_СтоимостьЧасаРаботы КАК СтоимостьЧасаРаботы,
		|	РАЗНОСТЬДАТ(ВКМ_ОбслуживаниеКлиента.ВремяНачалаРабот, ВКМ_ОбслуживаниеКлиента.ВремяОкончанияРабот, ЧАС) КАК
		|		КоличествоОтработанныхЧасов,
		|	ВКМ_ОбслуживаниеКлиента.Специалист КАК Специалист,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.Оклад, ""Не указан"") КАК Оклад,
		|	ЕСТЬNULL(ВКМ_УсловияОплатыСотрудниковСрезПоследних.ПроцентОтРабот, ""Не указан"") КАК ПроцентОтРабот
		|ИЗ
		|	Документ.ВКМ_ОбслуживаниеКлиента КАК ВКМ_ОбслуживаниеКлиента
		|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ВКМ_УсловияОплатыСотрудников.СрезПоследних КАК
		|			ВКМ_УсловияОплатыСотрудниковСрезПоследних
		|		ПО ВКМ_ОбслуживаниеКлиента.Специалист = ВКМ_УсловияОплатыСотрудниковСрезПоследних.Сотрудник
		|ГДЕ
		|	ВКМ_ОбслуживаниеКлиента.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскаяПлата;
	Запрос.УстановитьПараметр("ВидДоговора", ВидДоговора);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Возврат Выборка;
	
КонецФункции

Функция РассчетОтработанныхЧасов(ДатаНачала, ДатаОкончания)Экспорт
	
	ИтогоСекунд = 0;
    ТекущаяДата = НачалоДня(ДатаНачала);
    
 
    Пока ТекущаяДата <= ДатаОкончания Цикл
    	
    	//Запрос из цикла убрать не могу, работать не будет
    	Запрос = Новый Запрос;
        Запрос.Текст =
            "ВЫБРАТЬ
            |	РегламентированныйПроизводственныйКалендарь.ВидДня КАК ВидДня
            |ИЗ
            |	РегистрСведений.ВКМ_ГрафикиРаботы КАК РегламентированныйПроизводственныйКалендарь
            |ГДЕ
            |	РегламентированныйПроизводственныйКалендарь.Дата = &ДатаКалендаря";
 
        Запрос.УстановитьПараметр("ДатаКалендаря", ТекущаяДата);
        Выборка = Запрос.Выполнить().Выбрать();
 
        Если Выборка.Следующий() Тогда
            Если Выборка.ВидДня = Перечисления.ВКМ_ВидыДнейКалендаря.Рабочий Тогда
                
                // Определяем границы рабочего дня (здесь жестко заданы 9:00 и 18:00)
                НачалоРабочегоДня = ТекущаяДата + 9*3600;
                КонецРабочегоДня  = ТекущаяДата + 17*3600;
 
                // Определяем фактический интервал для расчета
                НачалоИнтервала = Макс(ДатаНачала, НачалоРабочегоДня);
                КонецИнтервала  = Мин(ДатаОкончания, КонецРабочегоДня);
 
                Если НачалоИнтервала < КонецИнтервала Тогда
                   ИтогоСекунд = ИтогоСекунд + (КонецИнтервала - НачалоИнтервала);
                КонецЕсли;
 
            КонецЕсли;
        КонецЕсли;
 
        ТекущаяДата = НачалоДня(ТекущаяДата) + 86400; // Переходим к следующему дню
 
    КонецЦикла;
 
    Возврат ИтогоСекунд / 3600;
	
КонецФункции

Процедура СозданиеУведомленияТелеграммБоту(ТекстСообщения)
	НовыйЭлемент = Справочники.ВКМ_УведомленияТелеграммБоту.СоздатьЭлемент();
	НовыйЭлемент.ТекстСообщения = ТекстСообщения;
	НовыйЭлемент.Записать();
КонецПроцедуры


#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru = 'Недопустимый вызов объекта на клиенте.'");
#КонецЕсли