
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ОбработкаЗаполнения(ДанныеЗаполнения, ТекстЗаполнения, СтандартнаяОбработка)
	
	Ответственный = Пользователи.ТекущийПользователь();
	
	Если ТипЗнч(ДанныеЗаполнения) = Тип("ДокументСсылка.ЗаказПокупателя") Тогда
		ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения);
	КонецЕсли;
	
КонецПроцедуры

Процедура ПередЗаписью(Отказ, РежимЗаписи, РежимПроведения)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;

	СуммаДокумента = Товары.Итог("Сумма") + Услуги.Итог("Сумма");
	
КонецПроцедуры

Процедура ОбработкаПроведения(Отказ, Режим)

	Движения.ОбработкаЗаказов.Записывать = Истина;
	Движения.ОстаткиТоваров.Записывать = Истина;
	
	Движение = Движения.ОбработкаЗаказов.Добавить();
	Движение.Период = Дата;
	Движение.Контрагент = Контрагент;
	Движение.Договор = Договор;
	Движение.Заказ = Основание;
	Движение.СуммаОтгрузки = СуммаДокумента;

	Для Каждого ТекСтрокаТовары Из Товары Цикл
		Движение = Движения.ОстаткиТоваров.Добавить();
		Движение.ВидДвижения = ВидДвиженияНакопления.Расход;
		Движение.Период = Дата;
		Движение.Контрагент = Контрагент;
		Движение.Номенклатура = ТекСтрокаТовары.Номенклатура;
		Движение.Сумма = ТекСтрокаТовары.Сумма;
		Движение.Количество = ТекСтрокаТовары.Количество;
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ВКМ_ВыполнитьАвтозаполнение()Экспорт
	//  Получаем номенклатуру из констант
	НоменклатураАбонентскаяПлата = Константы.ВКМ_НоменклатураАбонентскаяПлата.Получить();
	НоменклатураРаботыСпециалиста = Константы.ВКМ_НоменклатураРаботыСпециалиста.Получить();

	Если НоменклатураАбонентскаяПлата = ПустаяСтрока(НоменклатураАбонентскаяПлата) Или НоменклатураРаботыСпециалиста
		= ПустаяСтрока(НоменклатураРаботыСпециалиста) Тогда
		ВызватьИсключение "Для автозаполнения не заполнены константы номенклатуры.
						  |Обратитесь к администратору.";
	КонецЕсли;
	
	//  Очистка табличной части
	Товары.Очистить();
	Услуги.Очистить();
	
	//  Заполнение абонентской платой
	СуммаАбонПлаты = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Договор, "ВКМ_СуммаАбоненскойПлаты");
	Если СуммаАбонПлаты > 0 Тогда
		НоваяСтрока = Услуги.Добавить();
		НоваяСтрока.Номенклатура = НоменклатураАбонентскаяПлата;
		НоваяСтрока.Количество = 1;
		НоваяСтрока.Сумма = СуммаАбонПлаты;
	КонецЕсли;
	
	 //  Заполнение работами из регистра
        // Формируем границы месяца по дате документа
	НачалоМесяца = НачалоМесяца(Дата);
	КонецМесяца = КонецМесяца(Дата);
	
	Запрос = Новый Запрос;
    Запрос.Текст = 
    "ВЫБРАТЬ
    |	ЕСТЬNULL(ВКМ_ЗадолжностиКлиента.КоличествоЧасов, 0) КАК КоличествоРабот,
    |	ЕСТЬNULL(ВКМ_ЗадолжностиКлиента.СуммаКОплате, 0) КАК СуммаРабот
    |ИЗ
    |	РегистрНакопления.ВКМ_ЗадолжностиКлиента КАК ВКМ_ЗадолжностиКлиента
    |ГДЕ
    |	ВКМ_ЗадолжностиКлиента.Период МЕЖДУ &НачалоМесяца И &КонецМесяца
    |	И ВКМ_ЗадолжностиКлиента.Договор = &Договор";
    
      Запрос.УстановитьПараметр("Договор", Договор);
        Запрос.УстановитьПараметр("НачалоМесяца", НачалоМесяца);
        Запрос.УстановитьПараметр("КонецМесяца", КонецМесяца);
        
        Результат = Запрос.Выполнить().Выбрать();
        Если Результат.Следующий() И Результат.СуммаРабот > 0 Тогда
            НоваяСтрока = Услуги.Добавить();
            НоваяСтрока.Номенклатура = НоменклатураРаботыСпециалиста;
            НоваяСтрока.Количество = Результат.КоличествоРабот;
            // Цену можно рассчитать как Сумма / Количество, либо брать из регистра/договора
            НоваяСтрока.Цена = Результат.СуммаРабот / Результат.КоличествоРабот;
            НоваяСтрока.Сумма = Результат.СуммаРабот;
        КонецЕсли;

КонецПроцедуры

Процедура ЗаполнитьНаОснованииЗаказаПокупателя(ДанныеЗаполнения)
	
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	ЗаказПокупателя.Организация КАК Организация,
	               |	ЗаказПокупателя.Контрагент КАК Контрагент,
	               |	ЗаказПокупателя.Договор КАК Договор,
	               |	ЗаказПокупателя.СуммаДокумента КАК СуммаДокумента,
	               |	ЗаказПокупателя.Товары.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Товары,
	               |	ЗаказПокупателя.Услуги.(
	               |		Ссылка КАК Ссылка,
	               |		НомерСтроки КАК НомерСтроки,
	               |		Номенклатура КАК Номенклатура,
	               |		Количество КАК Количество,
	               |		Цена КАК Цена,
	               |		Сумма КАК Сумма
	               |	) КАК Услуги
	               |ИЗ
	               |	Документ.ЗаказПокупателя КАК ЗаказПокупателя
	               |ГДЕ
	               |	ЗаказПокупателя.Ссылка = &Ссылка";
	
	Запрос.УстановитьПараметр("Ссылка", ДанныеЗаполнения);
	
	Выборка = Запрос.Выполнить().Выбрать();
	
	Если Не Выборка.Следующий() Тогда
		Возврат;
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Выборка);
	
	ТоварыОснования = Выборка.Товары.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Товары.Добавить(), ТоварыОснования);
	КонецЦикла;
	
	УслугиОснования = Выборка.Услуги.Выбрать();
	Пока ТоварыОснования.Следующий() Цикл
		ЗаполнитьЗначенияСвойств(Услуги.Добавить(), УслугиОснования);
	КонецЦикла;
	
	Основание = ДанныеЗаполнения;
	
КонецПроцедуры

Процедура ВКМ_ПечатьАктаОбОказанныхУслугах(ТабДок) Экспорт
	//создание нового табличного документа
	ТабДок = Новый ТабличныйДокумент;

    //получение макета для печати расходной накладной
	Макет = Документы.РеализацияТоваровУслуг.ПолучитьМакет("ВКМ_АктОбОказанииУслуг");

    //получим область "Заголовок" как новый табличный документ (!)
	Область = Макет.ПолучитьОбласть("Заголовок");

    //укажем параметры области
	Область.Параметры.НомерДокумента = Номер;
	Область.Параметры.ДатаДокумента = Дата;
	Область.Параметры.Контрагент = Контрагент;
	Область.Параметры.Организация = Организация;
	Область.Параметры.Договор = Договор;
	
    //выведем заполненную область "Заголовок" в табличный документ
	ТабДок.Вывести(Область);

    //выведем область "Данные" в табличный документ
	ТабДок.Вывести(Макет.ПолучитьОбласть("ШапкаТЧ"));

    //получение области "Строка"
    //обратите внимание, что это можно сделать до цикла по строкам
	Область = Макет.ПолучитьОбласть("СтрокаТЧ");

    //вывод строк документа в печатную форму
	Для Каждого СтрУслуги Из Услуги Цикл
     
     //заполнение параметров области из строки табличной части
		Область.Параметры.Заполнить(СтрУслуги);

     //вывод сформированной области в табличный документ
		ТабДок.Вывести(Область);

	КонецЦикла;

    //вывод области "Подвал"
	Область = Макет.ПолучитьОбласть("Подвал");
	Область.Параметры.ОбщаяCумма = Услуги.Итог("Сумма");
	Область.Параметры.СуммаПрописью =  ЧислоПрописью(Услуги.Итог("Сумма"), "Л = ru_RU; ДП = Истина",
		"рубль, рубля, рублей, м, копейка, копейки, копеек, ж, 2");
	Область.Параметры.Ответственный = Ответственный;
	ТабДок.Вывести(Область);

    //установим параметры отображения табличного документа
	ТабДок.ТолькоПросмотр = Истина;
	ТабДок.ОтображатьЗаголовки = Истина;
	ТабДок.ОтображатьСетку = Ложь;

КонецПроцедуры

#КонецОбласти

#КонецЕсли
