
#Область ПрограммныйИнтерфейс

//Дополняет форму 
//Параметры:
//    Форма - ДанныеФормыСтруктура
Процедура ДополнитьФорму(Форма) Экспорт 
	
	ИмяФормы = Форма.ИмяФормы;
	
	Если ИмяФормы = "Справочник.ДоговорыКонтрагентов.Форма.ВКМ_ФормаЭлемента" Тогда
		ДобавитьРеквизитНаФормуДокументаДоговорыКонтрагентов(Форма);
	КонецЕсли;
	
КонецПроцедуры


#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

Процедура ДобавитьРеквизитНаФормуДокументаДоговорыКонтрагентов(Форма) Экспорт
	Если Форма.Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскаяПлата Тогда
		Если Форма.ЭтаФорма.Элементы.Найти("ВКМ_ПериодДействияДоговораНачало") = Неопределено
			И Форма.ЭтаФорма.Элементы.Найти("ВКМ_ПериодДействияДоговораКонец") = Неопределено Тогда
			// Добавляем Группу формы
			ГруппаПериоДействияДокумента = Форма.Элементы.Добавить("ГруппаПериоДействияДокумента", Тип("ГруппаФормы"), Форма);
			ГруппаПериоДействияДокумента.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаПериоДействияДокумента.Отображение = ОтображениеОбычнойГруппы.СильноеВыделение;
			ГруппаПериоДействияДокумента.Заголовок = "ПериодДействияДокумента";
			ГруппаПериоДействияДокумента.ОтображатьЗаголовок = Истина;
			ГруппаПериоДействияДокумента.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;	
			// Добавляем элементы формы
			ПолеВвода = Форма.Элементы.Вставить("ВКМ_ПериодДействияДоговораНачало", Тип("ПолеФормы"), ГруппаПериоДействияДокумента);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговораНачало";

			ПолеВвода = Форма.Элементы.Вставить("ВКМ_ПериодДействияДоговораКонец", Тип("ПолеФормы"), ГруппаПериоДействияДокумента);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_ПериодДействияДоговораКонец";
		
		КонецЕсли;
		
		Если Форма.ЭтаФорма.Элементы.Найти("ВКМ_СуммаАбоненскойПлаты") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Вставить("ВКМ_СуммаАбоненскойПлаты", Тип("ПолеФормы"), Форма);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СуммаАбоненскойПлаты";
		КонецЕсли;
		
		Если Форма.ЭтаФорма.Элементы.Найти("ВКМ_СтоимостьЧасаРаботы") = Неопределено Тогда
			ПолеВвода = Форма.Элементы.Вставить("ВКМ_СтоимостьЧасаРаботы", Тип("ПолеФормы"), Форма);
			ПолеВвода.Вид = ВидПоляФормы.ПолеВвода;
			ПолеВвода.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
		КонецЕсли;
	Иначе
		// Удаляем элементы формы
		УдаляемыйЭлемент = Форма.Элементы.Найти("ГруппаПериоДействияДокумента");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
		
		УдаляемыйЭлемент = Форма.Элементы.Найти("ВКМ_ПериодДействияДоговораНачало");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
		
		УдаляемыйЭлемент = Форма.Элементы.Найти("ВКМ_ПериодДействияДоговораКонец");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
		
		УдаляемыйЭлемент = Форма.Элементы.Найти("ВКМ_СуммаАбоненскойПлаты");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
		
		УдаляемыйЭлемент = Форма.Элементы.Найти("ВКМ_СтоимостьЧасаРаботы");
		Если УдаляемыйЭлемент <> Неопределено Тогда
			Форма.Элементы.Удалить(УдаляемыйЭлемент);
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти
