
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	
    // СтандартныеПодсистемы.ПодключаемыеКоманды
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
    // Конец СтандартныеПодсистемы.ПодключаемыеКоманды
	
КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
    ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);
КонецПроцедуры


#КонецОбласти

#Область СлужебныеПроцедурыИФункции 

&НаКлиенте
Процедура ВыполненныеРаботыЧасыКОплатеКлиентуПриИзменении(Элемент)
	ОтработаноЧасов = Неопределено;
	РасчетОтработаноЧасов(ОтработаноЧасов, Объект.ВремяНачалаРабот, Объект.ВремяОкончанияРабот);
	Если ОтработаноЧасов = Неопределено Тогда
	Иначе
		Элементы.ВыполненныеРаботы.ТекущиеДанные.ФактическиПотраченоЧасов = ОтработаноЧасов;
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ВыполненныеРаботыПриАктивизацииЯчейки(Элемент)
	
	ИмяЯчейки = Элемент.ТекущийЭлемент.Имя;
	Если ИмяЯчейки = "ВыполненныеРаботыЧасыКОплатеКлиенту"  Тогда
		ОтработаноЧасов = Неопределено;
		РасчетОтработаноЧасов(ОтработаноЧасов, Объект.ВремяНачалаРабот, Объект.ВремяОкончанияРабот);
		Если ОтработаноЧасов = Неопределено Тогда
		Иначе
			Элементы.ВыполненныеРаботы.ТекущиеДанные.ЧасыКОплатеКлиенту = ОтработаноЧасов;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры


&НаСервере
Процедура РасчетОтработаноЧасов(ОтработаноЧасов, ВремяНачалаРабот, ВремяОкончанияРабот)
	Если ЗначениеЗаполнено(Объект.ВремяНачалаРабот) И ЗначениеЗаполнено(Объект.ВремяОкончанияРабот) Тогда
		ДокОбъект = РеквизитФормыВЗначение("Объект");
		ОтработаноЧасов = ДокОбъект.РассчетОтработанныхЧасов(ВремяНачалаРабот,ВремяОкончанияРабот); 
	КонецЕсли;
КонецПроцедуры

#Область ПодключаемыеКоманды

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
    ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
    ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(ПараметрыВыполнения)
    ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
    ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры


// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти


#КонецОбласти