
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	// Получить количество дней
	МассивСотрудников = ПолучитьКоличествоДнейОтпуска(); 
	
	//Подсветка строк 
	ПодсветкаСтрок(МассивСотрудников);
КонецПроцедуры

#КонецОбласти

#Область  ОбработчикиСобытийЭлементовТаблицыФормыОтпускаСотрудников

&НаКлиенте
Процедура ОтпускаСотрудниковДатаНачалаПриИзменении(Элемент)
	КолвоДнейОтпуска();
КонецПроцедуры

&НаКлиенте
Процедура ОтпускаСотрудниковДатаОкончанияПриИзменении(Элемент)
	КолвоДнейОтпуска();
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура АнализГрафика(Команда)
	АдресВХранилище = ПоместитьВовременноеХранилищеНаСервере();
	ПараметрыФормы = Новый Структура("АдресВХранилище", АдресВХранилище);
	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.АнализГрафика", ПараметрыФормы, ЭтотОбъект)
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПоместитьВовременноеХранилищеНаСервере()
	Адрес = ПоместитьВовременноеХранилище(Объект.ОтпускаСотрудников.Выгрузить( , "Сотрудник,ДатаНачала,ДатаОкончания"),
		);
	Возврат Адрес;
КонецФункции

&НаСервере
Процедура КолвоДнейОтпуска()
	// Получить количество дней
	МассивСотрудников = ПолучитьКоличествоДнейОтпуска(); 
	 
	//Подсветка строк 
	ПодсветкаСтрок(МассивСотрудников);
КонецПроцедуры

&НаСервере
Функция ПолучитьКоличествоДнейОтпуска()
	
	ТЗОтпускаСотрудников = Объект.ОтпускаСотрудников.Выгрузить(, "Сотрудник, ДатаНачала,ДатаОкончания"); 
	ТЗОтпускаСотрудников.Колонки.Добавить("КоличествоДней");
	Для Каждого ТекущаяСтрока Из ТЗОтпускаСотрудников Цикл
		ТекущаяСтрока.КоличествоДней = (НачалоДня(ТекущаяСтрока.ДатаОкончания) - НачалоДня(ТекущаяСтрока.ДатаНачала))/86400;
	КонецЦикла;
	ТЗОтпускаСотрудников.Свернуть("Сотрудник", "КоличествоДней");
	МассивСотрудников = ОбщегоНазначения.ТаблицаЗначенийВМассив(ТЗОтпускаСотрудников);
	
	Возврат МассивСотрудников;
	
КонецФункции

&НаСервере
Процедура ПодсветкаСтрок(МассивСотрудников)
	УсловноеОформление.Элементы.Очистить();
	Для Каждого СтрокаМассивСотрудников Из МассивСотрудников Цикл
		Если СтрокаМассивСотрудников.КоличествоДней > 28 Тогда
			Для Каждого Строка Из Объект.ОтпускаСотрудников Цикл
				Если СтрокаМассивСотрудников.Сотрудник = Строка.Сотрудник Тогда
					// Создаем новый элемент оформления
					ЭлементУО = УсловноеОформление.Элементы.Добавить();
					// 1. Устанавливаем, ЧТО именно меняем (Цвет фона)
					ЭлементУО.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Красный);
					
					// 2. Устанавливаем УСЛОВИЕ
					ЭлементУсловия = ЭлементУО.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
					ЭлементУсловия.Использование = Истина;
					ЭлементУсловия.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.ОтпускаСотрудников.Сотрудник");
					ЭлементУсловия.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
					ЭлементУсловия.ПравоеЗначение = СтрокаМассивСотрудников.Сотрудник;
					// 3. Выбераем подсвеченные колонки
					ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковСотрудник");
					
					ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаНачала");
					
					ОформляемоеПоле = ЭлементУО.Поля.Элементы.Добавить();
					ОформляемоеПоле.Поле = Новый ПолеКомпоновкиДанных("ОтпускаСотрудниковДатаОкончания");
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
