
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура Заполнить(Команда)
	ВыполнитьОбработку();
	ТекстСообщения = "Обработка завершена!";
	ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

&НаКлиенте
Процедура Очистить(Команда)
	ОчиститьНаСервере();
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ВыполнитьОбработку()
	ОбработкаОбъект = РеквизитФормыВЗначение("Объект");
    ОбработкаОбъект.ЗаполнитьГрафик(ВыборПериода.ДатаНачала, ВыборПериода.ДатаОкончания, ВыходныеДни, ГрафикРаботы);
КонецПроцедуры 

&НаСервере
Процедура ОчиститьНаСервере()
	Набор = РегистрыСведений.ВКМ_ГрафикиРаботы.СоздатьНаборЗаписей();
	Набор.Записать();
	ТекстСообщения = "Очистка завершена!";
	ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
КонецПроцедуры

#КонецОбласти
