
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗаполнитьТабличнуюЧасть(Команда)
	Если Объект.Выплаты.Количество() = 0 Тогда
		ЗаполнитьТабличнуюЧастьНаСервере();
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура ЗаполнитьТабличнуюЧастьНаСервере()
	ДокОбъект = РеквизитФормыВЗначение("Объект");
	Выборка = ДокОбъект.ЗаполнениеТабличнойЧасти();
		
	Пока Выборка.Следующий() Цикл
		НовСтр = Объект.Выплаты.Добавить();
        ЗаполнитьЗначенияСвойств(НовСтр, Выборка);
	КонецЦикла;
КонецПроцедуры

#КонецОбласти