
#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Заполнить(Команда)
	Объект.Договоры.Очистить();
	ЗаполнитьНаСервере();
КонецПроцедуры

// Не пойму как сделать длительную операцию через БСП
&НаКлиенте
Процедура СоздатьРеализацию(Команда)
	СоздатьРеализациюНаСервере();
	Заполнить(Команда);
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции


&НаСервере
Процедура ЗаполнитьНаСервере()
	
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	ДоговорыКонтрагентов.Ссылка КАК ДоговорСсылка,
		|	ДоговорыКонтрагентов.ВидДоговора КАК ДоговорВидДоговора,
		|	РеализацияТоваровУслуг.Ссылка КАК СсылкаРеализация,
		|	РеализацияТоваровУслуг.Договор КАК ДоговорРеализация
		|ИЗ
		|	Справочник.ДоговорыКонтрагентов КАК ДоговорыКонтрагентов
		|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
		|		ПО ДоговорыКонтрагентов.Ссылка = РеализацияТоваровУслуг.Договор
		|ГДЕ
		|	ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораНачало >= &ДатаНачало
		|	И ДоговорыКонтрагентов.ВКМ_ПериодДействияДоговораКонец <= &ДатаКонец
		|	И ДоговорыКонтрагентов.ВидДоговора = &ВидДоговора";
	
	Запрос.УстановитьПараметр("ВидДоговора", Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбоненскаяПлата);
	Запрос.УстановитьПараметр("ДатаНачало", Объект.Период.ДатаНачала);
	Запрос.УстановитьПараметр("ДатаКонец", Объект.Период.ДатаОкончания);
	
	РезультатЗапроса = Запрос.Выполнить();
	Выборка = РезультатЗапроса.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Договоры.Добавить();
		НоваяСтрока.Договор = Выборка.ДоговорСсылка;
		НоваяСтрока.Реализация = Выборка.СсылкаРеализация;
	КонецЦикла;
	
КонецПроцедуры


&НаСервере
Процедура СоздатьРеализациюНаСервере()
	
	Договоры = Объект.Договоры;
	Для Каждого Строка Из Договоры Цикл
		Если Не ЗначениеЗаполнено(Строка.Реализация) Тогда
			НовыйДокумент = Документы.РеализацияТоваровУслуг.СоздатьДокумент();
			// Заполнение договора
			НовыйДокумент.Дата = ТекущаяДата();
			НовыйДокумент.Договор = Строка.Договор;
			// Очень много потратил времени. Оставил так, если подскажете как сделать подругому,
			// буду благодарен. И все равно не пойму почему в некоторых ситуациях можно обрацаться в цикле через 
			// точку, а в других нельзя. Почему сдесь нельзя? 
			// Я не понял как вызывать стандартный алгоритм заполнения.
			НовыйДокумент.Контрагент = Строка.Договор.Владелец;
			НовыйДокумент.Организация = Строка.Договор.Организация;
			//
			НовыйДокумент.Проведен = Истина;
			НовыйДокумент.ВКМ_ВыполнитьАвтозаполнение();
			
			Если ЗначениеЗаполнено(НовыйДокумент.Дата) И ЗначениеЗаполнено(НовыйДокумент.Договор) И
				ЗначениеЗаполнено(НовыйДокумент.Контрагент) И ЗначениеЗаполнено(НовыйДокумент.Организация) Тогда
				НовыйДокумент.Записать();
			КонецЕсли;   
			
		КонецЕсли;
	КонецЦикла;
КонецПроцедуры

#КонецОбласти
